app/views/publications/_form.html.erb

<script>
  $(document).ready(function () {
    <% @user_ids = [] %>
    <%
    @publication.users.each do |user|
    @user_ids.push(user.id)
    end
    %>
    $('.selectpicker').val(<%= @user_ids %>);
    $('.selectpicker').selectpicker('refresh');
  });
---
SELECT "users".* FROM "users" INNER JOIN "user_publications" ON "users"."id" = "user_publications"."user_id" WHERE "user_publications"."publication_id" = ?  [["publication_id", 1]]