app/views/projects/_form.html.erb

SELECT "users".* FROM "users" INNER JOIN "people_projects" ON "users"."id" = "people_projects"."user_id" WHERE "people_projects"."project_id" = ?  [["project_id", 1]]
---
<script>
  $(document).ready(function () {
    <% @user_ids = [] %>
    <%
    @project.users.each do |user|
    @user_ids.push(user.id)
    end
    %>
    $('.selectpicker').val(<%= @user_ids %>);
    $('.selectpicker').selectpicker('refresh');
  });