app/controllers/news_controller.rb

    def create
        @news = News.new(news_params)

        respond_to do |format|
            if @news.save
---
INSERT INTO "news" ("body", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "123"], ["title", "3123"], ["created_at", "2016-04-09 12:38:38.920066"], ["updated_at", "2016-04-09 12:38:38.920066"]]

    def set_news
        @news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", 1]]