app/controllers/profiles_controller.rb

    def index
        @profiles = User.all
---
SELECT "users".* FROM "users"

    def set_profile
        @profile = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]