app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "goal", "sponsor_id", "start_date", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"
SELECT "sponsors".* FROM "sponsors"
---
    def create
        @project = Project.create_with_user(project_params, user_params)

        respond_to do |format|
            if @project.save
                format.html { redirect_to @project, notice: 'Project was successfully created.' }
                format.json { render :show, status: :created, location: @project }
            else
                @users = User.all
                @sponsors = Sponsor.all

UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "123131"], ["updated_at", "2016-07-30 12:35:36.026458"], ["id", 13]]
SELECT "users".* FROM "users"
SELECT "sponsors".* FROM "sponsors"
---
    def update
        respond_to do |format|
            if @project.update_with_user(project_params, user_params)
                format.html { redirect_to @project, notice: 'Project was successfully updated.' }
                format.json { render :show, status: :ok, location: @project }
            else
                @users = User.all
                @sponsors = Sponsor.all

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
    def destroy
        @project.destroy_with_dependencies

SELECT "users".* FROM "users"
SELECT "sponsors".* FROM "sponsors"
---
    def set_dependency
        @users = User.all
        @sponsors = Sponsor.all