app/controllers/publications_controller.rb

    def new
        @publication = Publication.new
        @journals = Journal.all
        @users = User.all
---
SELECT "journals".* FROM "journals"
SELECT "users".* FROM "users"

    def edit
        @journals = Journal.all
        @users = User.all
---
SELECT "journals".* FROM "journals"
SELECT "users".* FROM "users"

    def create
        @publication = Publication.create_with_user(publication_params, user_params)

        respond_to do |format|
            if @publication.save
                format.html { redirect_to @publication, notice: 'Publication was successfully created.' }
                format.json { render :show, status: :created, location: @publication }
            else
                @journals = Journal.all
                @users = User.all
---
INSERT INTO "publications" ("title", "year", "page", "volume", "journal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "dad"], ["year", 2015], ["page", 4234], ["volume", 4234], ["journal_id", 2], ["created_at", "2016-07-30 22:51:47.164854"], ["updated_at", "2016-07-30 22:51:47.164854"]]
SELECT "journals".* FROM "journals"
SELECT "users".* FROM "users"

    def update
        respond_to do |format|
            if @publication.update_with_user(publication_params, user_params)
---
UPDATE "publications" SET "title" = ?, "updated_at" = ? WHERE "publications"."id" = ?  [["title", "dadwrwr"], ["updated_at", "2016-08-01 23:38:11.524199"], ["id", 1]]