app/controllers/publishers_controller.rb

SELECT "publishers".* FROM "publishers"
---
    def index
        @publishers = Publisher.all

INSERT INTO "publishers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2016-06-26 19:11:20.914605"], ["updated_at", "2016-06-26 19:11:20.914605"]]
---
    def create
        @publisher = Publisher.new(publisher_params)

        respond_to do |format|
            if @publisher.save

SELECT  "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_publisher
        @publisher = Publisher.find(params[:id])