app/controllers/publications_controller.rb

SELECT "publishers".* FROM "publishers"
---
    def new
        @publication = Publication.new
        @publishers = Publisher.all

SELECT "publishers".* FROM "publishers"
---
    def create
        @publication = Publication.new(publication_params)

        respond_to do |format|
            if @publication.save
                format.html { redirect_to @publication, notice: 'Publication was successfully created.' }
                format.json { render :show, status: :created, location: @publication }
            else
                @publishers = Publisher.all